# 02-1 숫자형

# 1. 정수형
# 양의 정수와 음의 정수, 0을 변수에 대입하여 사용.
a = 122   # 양의 정수
b = -122  # 음의 정수
c = 0     # 숫자 0

# 2. 실수형
# 소수점이 포함된 숫자를 말함.
a = 1.22
b = 123.123

# 3. 컴퓨터식 지수 표현 방식
# 4.56E10은 4.56 * 10의 10승을 의미하고 4.56E-10은 4.56 * 10의 -10승을 의미함.
a = 4.56E10
b = 4.56E-10

# 4. 8진수
# 8진수를 만들기 위해선 0o나 0O로 시작하면 된다.
a = 0o7677
print(a)
# 4031

# 5. 16진수
# 16진수를 만들기 위해선 0x로 시작하면 된다.
a = 0x833
print(a)
# 2099

# 6. 사칙연산
# 기본적인 사칙연산 + - * / 를 사용하여 계산기처럼 사용할 수 있다.
a = 1
b = 5
a + b # 더하기
# 6

a - b # 빼기
# -4

a * b # 곱하기
# 5

a / b # 나누기
# 0.2

# 7. x의 y제곱을 나타내는 ** 연산자
# 이 연산자는 x ** y 처럼 사용했을때 x의 y승 값을 리턴한다.
a = 2
b = 3
a ** b
# 8

# 8. 나눈셈 후 나머지를 리턴하는 % 연산자
# %는 나눗셈의 나머지 값을 리턴하는 연산자.
8 % 3
# 2

# 9. 나눗셈 후 몫을 리턴하는 // 연산자
# // 연산자는 몫을 정수로 리턴하는 연산자.
9 // 4
# 2

# 마무리 정리
# 1. 10 × 8 ÷ 6 + 8^6의 값을 구하시오.
# 해설: 10 * 8 / 6 + 8 ** 6
# 결과: 262157.3333333333

# 2. 숫자 86을 6으로 나누었을 때 몫과 나머지를 구하시오.
# 해설: 86 // 6 (몫 구하기) 86 % 6 (나머지 구하기)
# 결과 몫= 14 나머지= 2
